**EJERCICIOS PAIR INTRO A PANDAS**

In [26]:
import pandas as pd
import numpy as np

1- ¿Qué diferencia hay entre una Serie y un DataFrame?

- Una serie es unidimensional y un DataFrame es bidimensional.   
- En las series los elementos tienen que ser homogéneos (de un sólo tipo), el DataFrame pueden ser variados

2- Momento de trabajar con Series. Contesta a las siguientes preguntas:  
Crea dos listas:   
    - Una que se llame "valores" que tenga 7 números aleatorios.   
    - Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [2]:
#Lista con valores aleatorios

valores = [5, 8, 6, 9, 3, 4, 1]

#Lista índices 

indices = ['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado', 'domingo']

In [20]:
type(valores)

list

A partir de estas dos listas crea una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [8]:
serie = pd.Series(valores, index = indices)

In [9]:
serie

lunes        5
martes       8
miercoles    6
jueves       9
viernes      3
sabado       4
domingo      1
dtype: int64

A partir de las dos listas anteriores crea un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez.

In [10]:
diccionario = {}

for i, v in zip(indices, valores):
    diccionario[i] = v

In [11]:
diccionario

{'lunes': 5,
 'martes': 8,
 'miercoles': 6,
 'jueves': 9,
 'viernes': 3,
 'sabado': 4,
 'domingo': 1}

Crea una Serie con el diccionario creado en el punto anterior.

In [13]:
serie_diccionario = pd.Series(diccionario)
serie_diccionario

lunes        5
martes       8
miercoles    6
jueves       9
viernes      3
sabado       4
domingo      1
dtype: int64

In [60]:
#¿Qué forma tiene esta última Serie?

print(f'La forma de la serie del diccionario es: {serie_diccionario.shape}')

La forma de la serie del diccionario es: (7,)

In [61]:
# ¿Qué tipo de datos tiene?

print(f'Los tipos de los datos de la serie del diccionario son: {serie_diccionario.dtype}')

Los tipos de los datos de la serie del diccionario son: int64

In [62]:
# ¿Qué tamaño tiene?

print(f'El tamaño de la serie del diccionario es: {serie_diccionario.size}')

El tamaño de la serie del diccionario es: 7

In [63]:
# ¿Cuáles son los índices de la Serie?

print(f'Los índices son: {serie_diccionario.index}')

Los índices son: Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')

In [64]:
# ¿Y los values?

print(f'Los valores son: {serie_diccionario.values}')

Los valores son: [5 8 6 9 3 4 1]

In [66]:
# Extrae el valor para el índice "lunes"

print(f"El valor del índice lunes es: {serie_diccionario['lunes']}")

El valor del índice lunes es: 5

In [73]:
# Extrae el valor para el índice "lunes", "martes" y "miércoles".

print(f"El valor de los índices lunes, martes y miércoles son: \n{serie_diccionario['lunes':'miercoles']}")

El valor de los índices lunes, martes y miércoles son:
lunes        5
martes       8
miercoles    6
dtype: int64

In [74]:
#Extrae el valor para el índice "lunes" y "domingo".

print(f"El valor de los índices lunes y domingo son: \n{serie_diccionario['lunes'::6]}")

El valor de los índices lunes y domingo son:
lunes      5
domingo    1
dtype: int64

3- Es el turno de los DataFrames

In [27]:
# Crea un array de dos dimensiones con 4 filas y 3 columnas.   

array2d = np.array([[10, 20, 30],[40, 50, 60],[70, 80, 90],[100, 110, 120]])
array2d

array([[ 10,  20,  30],
       [ 40,  50,  60],
       [ 70,  80,  90],
       [100, 110, 120]])

In [28]:
# Convierte el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".  

df_paises = pd.DataFrame(array2d, columns=['España', 'Francia', 'Italia'])
df_paises

   España  Francia  Italia
0      10       20      30
1      40       50      60
2      70       80      90
3     100      110     120

In [33]:
# Descarga el archivo "medallas" y carga el DataFrame.  

df_medallas = pd.read_csv('files/medallas.csv', index_col=0)
df_medallas

               País   Oro  Plata  Bronce
1             China  1473    994     720
2             Japón  1032   1037     985
3     Corea del Sur   745    663     827
4              Irán   179    181     197
5        Kazajistán   155    158     224
6             India   154    202     315
7         Tailandia   132    175     278
8         Indonesia   112    131     240
9      China Taipéi    99    144     276
10  Corea del Norte    91    120     235

In [35]:
# Usando el loc extrae todas las columnas de la fila de Tailandia.  

df_medallas.loc[7,:]

País      Tailandia
Oro             132
Plata           175
Bronce          278
Name: 7, dtype: object

In [39]:
# Usando el loc extrae todas las columnas de China e Irán. 

df_medallas.loc[1:4:3,:]

    País   Oro  Plata  Bronce
1  China  1473    994     720
4   Irán   179    181     197

In [40]:
#- Usando el loc extrae solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.   

df_medallas.loc[1:4:3,'Oro':'Bronce']

    Oro  Plata  Bronce
1  1473    994     720
4   179    181     197

In [41]:
# Usando el iloc extrae la información de la India. Devolved todas las columnas.  

df_medallas.iloc[5,:]

País      India
Oro         154
Plata       202
Bronce      315
Name: 6, dtype: object

In [43]:
# Usando el iloc extrae todas las columnas de los paises que estén en posición impar. 
# La primera que nos tendría que salir es Japón y la última Corea del Norte.

df_medallas.iloc[1::2,:]

               País   Oro  Plata  Bronce
2             Japón  1032   1037     985
4              Irán   179    181     197
6             India   154    202     315
8         Indonesia   112    131     240
10  Corea del Norte    91    120     235

In [45]:
#Utilizando el código del ejercicio anterior, selecciona unicamente las columnas "Oro", "Plata" y "Bronce".

df_medallas.iloc[1::2,1:4]

     Oro  Plata  Bronce
2   1032   1037     985
4    179    181     197
6    154    202     315
8    112    131     240
10    91    120     235

In [52]:
#¿Qué país consiguió más de 200 medallas de oro?

oro = df_medallas[df_medallas['Oro'] > 200]['País']
oro

1            China
2            Japón
3    Corea del Sur
Name: País, dtype: object

In [56]:
# ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

oro_plata = df_medallas[(df_medallas['Oro'] > 200) & (df_medallas['Plata'] > 1000)]['País']
oro_plata

2    Japón
Name: País, dtype: object

In [57]:
# ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

oro_bronce = df_medallas[(df_medallas['Oro'] > 200) | (df_medallas['Bronce'] > 700)]['País']
oro_bronce

1            China
2            Japón
3    Corea del Sur
Name: País, dtype: object

In [58]:
# Crea una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.

df_medallas['Total'] = df_medallas['Oro'] + df_medallas['Plata'] + df_medallas['Bronce']

df_medallas

               País   Oro  Plata  Bronce  Total
1             China  1473    994     720   3187
2             Japón  1032   1037     985   3054
3     Corea del Sur   745    663     827   2235
4              Irán   179    181     197    557
5        Kazajistán   155    158     224    537
6             India   154    202     315    671
7         Tailandia   132    175     278    585
8         Indonesia   112    131     240    483
9      China Taipéi    99    144     276    519
10  Corea del Norte    91    120     235    446